from matplotlib import pyplot as plt
import graphs as g
import numpy as np


# экспоненциальная функция потерь
def loss(w, x, y):
    M = np.dot(w, x) * y
    return np.exp(-M)


# производная экспоненциальной функции потерь по вектору w
def df(w, x, y):
    M = np.dot(w, x) * y
    return -np.exp(-M) * x.T * y


data_x = [(5.8, 1.2), (5.6, 1.5), (6.5, 1.5), (6.1, 1.3), (6.4, 1.3), (7.7, 2.0), (6.0, 1.8), (5.6, 1.3), (6.0, 1.6), (5.8, 1.9), (5.7, 2.0), (6.3, 1.5), (6.2, 1.8), (7.7, 2.3), (5.8, 1.2), (6.3, 1.8), (6.0, 1.0), (6.2, 1.3), (5.7, 1.3), (6.3, 1.9), (6.7, 2.5), (5.5, 1.2), (4.9, 1.0), (6.1, 1.4), (6.0, 1.6), (7.2, 2.5), (7.3, 1.8), (6.6, 1.4), (5.6, 2.0), (5.5, 1.0), (6.4, 2.2), (5.6, 1.3), (6.6, 1.3), (6.9, 2.1), (6.8, 2.1), (5.7, 1.3), (7.0, 1.4), (6.1, 1.4), (6.1, 1.8), (6.7, 1.7), (6.0, 1.5), (6.5, 1.8), (6.4, 1.5), (6.9, 1.5), (5.6, 1.3), (6.7, 1.4), (5.8, 1.9), (6.3, 1.3), (6.7, 2.1), (6.2, 2.3), (6.3, 2.4), (6.7, 1.8), (6.4, 2.3), (6.2, 1.5), (6.1, 1.4), (7.1, 2.1), (5.7, 1.0), (6.8, 1.4), (6.8, 2.3), (5.1, 1.1), (4.9, 1.7), (5.9, 1.8), (7.4, 1.9), (6.5, 2.0), (6.7, 1.5), (6.5, 2.0), (5.8, 1.0), (6.4, 2.1), (7.6, 2.1), (5.8, 2.4), (7.7, 2.2), (6.3, 1.5), (5.0, 1.0), (6.3, 1.6), (7.7, 2.3), (6.4, 1.9), (6.5, 2.2), (5.7, 1.2), (6.9, 2.3), (5.7, 1.3), (6.1, 1.2), (5.4, 1.5), (5.2, 1.4), (6.7, 2.3), (7.9, 2.0), (5.6, 1.1), (7.2, 1.8), (5.5, 1.3), (7.2, 1.6), (6.3, 2.5), (6.3, 1.8), (6.7, 2.4), (5.0, 1.0), (6.4, 1.8), (6.9, 2.3), (5.5, 1.3), (5.5, 1.1), (5.9, 1.5), (6.0, 1.5), (5.9, 1.8)]
data_y = [-1, -1, -1, -1, -1, 1, 1, -1, -1, 1, 1, -1, 1, 1, -1, 1, -1, -1, -1, 1, 1, -1, -1, -1, -1, 1, 1, -1, 1, -1, 1, -1, -1, 1, 1, -1, -1, 1, 1, -1, 1, 1, -1, -1, -1, -1, 1, -1, 1, 1, 1, 1, 1, -1, -1, 1, -1, -1, 1, -1, 1, -1, 1, 1, -1, 1, -1, 1, 1, 1, 1, 1, -1, -1, 1, 1, 1, -1, 1, -1, -1, -1, -1, 1, 1, -1, 1, -1, 1, 1, 1, 1, -1, 1, 1, -1, -1, -1, -1, 1]

x_train = np.array([[1, x[0], x[1]] for x in data_x])
y_train = np.array(data_y)

n_train = len(x_train)  # размер обучающей выборки
w = [0.0, 0.0, 0.0]  # начальные весовые коэффициенты
nt = np.array([0.5, 0.01, 0.01])  # шаг обучения для каждого параметра w0, w1, w2
lm = 0.01  # значение параметра лямбда для вычисления скользящего экспоненциального среднего
N = 500  # число итераций алгоритма SGD
batch_size = 10 # размер мини-батча (величина K = 10)

Qe = np.average([loss(w, x, y) for x, y in zip(x_train, y_train)])# начальное значение среднего эмпирического риска
# Qe = np.average(loss(w, x_train.T, y_train))
np.random.seed(0) # генерация одинаковых последовательностей псевдослучайных чисел

# Визуализация
fig, ax = g.create_window(title='Модель: $w_0 + w_1x_1 + w_2x_2 = 0$', ox_name='$x_1$', oy_name='$x_2$')
g.drow_cls_points(ax, x_train, y_train)

features = ['(-x_1)', '(-1)']
left_part=r'x_2 = -\frac{w_1}{w_2}x_1 - \frac{w_0}{w_2} = a(x)'
line = g.create_line(ax, features, left_part)
edges = min(x_train[:, 1] - 3), max(x_train[:, 1] + 3)
text = g.add_text(ax, 'Итерация: 0\n' f'Q = {Qe}\n' f'w = {w}')

for i in range(N):
    k = np.random.randint(0, n_train - batch_size - 1)

    X_train = x_train[k: k + batch_size]
    Y_train = y_train[k: k + batch_size]

    grad = np.mean([df(w, x, y) for x, y in zip(X_train, Y_train)], axis=0)
    loss_av_k = np.mean([loss(w, x, y) for x, y in zip(X_train, Y_train)], axis=0)
    # loss_av_k = np.average(loss(w, X_train.T, Y_train))
    Qe = lm * loss_av_k + (1 - lm) * Qe
    w = w - nt * grad

    # Обновляем
    g.update_line(line, edges, w, features, left_part)
    text.set_text(f'Итерация: {i + 1} / {N}\nQ = {Qe:.4f}\nw = {np.round(w, 2)}')
    ax.legend()
    plt.pause(0.005)

Q = np.average([int(np.dot(w, x) * y < 0) for x, y in zip(x_train, y_train)])

print(w)
print(Q)

plt.show()