import matplotlib.pyplot as plt
import numpy as np
from graphs import ClassificationPlot

data_x = [(7.2, 2.5), (6.4, 2.2), (6.3, 1.5), (7.7, 2.2), (6.2, 1.8), (5.7, 1.3), (7.1, 2.1), (5.8, 2.4), (5.2, 1.4), (5.9, 1.5), (7.0, 1.4), (6.8, 2.1), (7.2, 1.6), (6.7, 2.4), (6.0, 1.5), (5.1, 1.1), (6.6, 1.3), (6.1, 1.4), (6.7, 2.1), (6.4, 1.8), (5.6, 1.3), (6.9, 2.3), (6.4, 1.9), (6.9, 2.3), (6.5, 2.2), (6.0, 1.5), (5.6, 1.1), (5.6, 1.5), (6.0, 1.0), (6.0, 1.8), (6.7, 2.5), (7.7, 2.3), (5.5, 1.1), (5.8, 1.0), (6.9, 2.1), (6.6, 1.4), (6.3, 1.6), (6.1, 1.4), (5.0, 1.0), (7.7, 2.0), (4.9, 1.7), (7.2, 1.8), (6.8, 1.4), (6.1, 1.2), (5.8, 1.9), (6.3, 2.5), (5.7, 2.0), (6.5, 1.8), (7.6, 2.1), (6.3, 1.5), (6.7, 1.4), (6.4, 2.3), (6.2, 2.3), (6.3, 1.9), (5.5, 1.3), (7.9, 2.0), (6.7, 1.8), (6.4, 1.3), (6.5, 2.0), (6.5, 1.5), (6.9, 1.5), (5.6, 1.3), (5.8, 1.2), (6.7, 2.3), (6.0, 1.6), (5.7, 1.2), (5.7, 1.0), (5.5, 1.0), (6.1, 1.4), (6.3, 1.8), (5.7, 1.3), (6.1, 1.3), (5.5, 1.3), (6.3, 1.3), (5.9, 1.8), (7.7, 2.3), (6.5, 2.0), (5.6, 2.0), (6.7, 1.7), (5.7, 1.3), (5.5, 1.2), (5.0, 1.0), (5.8, 1.9), (6.2, 1.3), (6.2, 1.5), (6.3, 2.4), (6.4, 1.5), (7.4, 1.9), (6.8, 2.3), (5.6, 1.3), (5.8, 1.2), (7.3, 1.8), (6.7, 1.5), (6.3, 1.8), (6.0, 1.6), (6.4, 2.1), (6.1, 1.8), (5.9, 1.8), (5.4, 1.5), (4.9, 1.0)]
data_y = [1, 1, 1, 1, 1, -1, 1, 1, -1, -1, -1, 1, 1, 1, -1, -1, -1, 1, 1, 1, -1, 1, 1, 1, 1, 1, -1, -1, -1, 1, 1, 1, -1, -1, 1, -1, -1, -1, -1, 1, 1, 1, -1, -1, 1, 1, 1, 1, 1, -1, -1, 1, 1, 1, -1, 1, 1, -1, 1, -1, -1, -1, -1, 1, -1, -1, -1, -1, -1, 1, -1, -1, -1, -1, 1, 1, 1, 1, -1, -1, -1, -1, 1, -1, -1, 1, -1, 1, 1, -1, -1, 1, -1, 1, -1, 1, 1, -1, -1, -1]

x_train = np.array(data_x)
y_train = np.array(data_y)

# математические ожидания
mx11, mx12 = np.mean(x_train[y_train == -1], axis=0)
mx21, mx22 = np.mean(x_train[y_train == 1], axis=0)

# дисперсии
Dx11, Dx12 = np.var(x_train[y_train == -1], axis=0)
Dx21, Dx22 = np.var(x_train[y_train == 1], axis=0)

lm1 = 1     # штраф неверной классификации 1-го класса (-1)
lm2 = 1     # штраф неверной классификации 2-го класса (+1)
P1 = 0.5    # априорная вероятность появления образов 1-го класса
P2 = 1 - P1 # априорная вероятность появления образов 2-го класса

def a_y1(x: list):
    x1, x2 = x[0], x[1]
    log_const = np.log(1 / (2 * np.pi * np.sqrt(Dx11 * Dx12)))
    log_likelihood = -((x1 - mx11) ** 2) / (2 * Dx11) - ((x2 - mx12) ** 2) / (2 * Dx12)
    log_prior = np.log(P1)
    return log_const + log_likelihood + log_prior

def a_y2(x: list):
    x1, x2 = x[0], x[1]
    log_const = np.log(1 / (2 * np.pi * np.sqrt(Dx21 * Dx22)))
    log_likelihood = -((x1 - mx21) ** 2) / (2 * Dx21) - ((x2 - mx22) ** 2) / (2 * Dx22)
    log_prior = np.log(P2)
    return log_const + log_likelihood + log_prior

def decision(selection: np.array):
    if selection.ndim != 2 or selection.shape[1] != 2:
        raise ValueError(f"Ожидается матрица с 2 столбцами, получена форма {selection.shape}")

    res = np.array([np.argmax([a_y1(p_ij), a_y2(p_ij)]) * 2 - 1 for p_ij in selection])
    return res

predict = decision(x_train)
Q = np.average([1 if x != y else 0 for x, y in zip(predict, y_train)])

c = ClassificationPlot("Наивная байесовская классификация", figsize=(10, 6))
settings = ({"label":"Класс 1 (y = 1)", "s":60},
            {"label":"Класс 2 (y = -1)", "s":60},
            {"label":"Ошибка", "marker":"x", "s":100, "linewidths":2})
mistakes = [2 if x != y else x for x, y in zip(predict, y_train)]

c.draw_cls_points(x_train, mistakes, settings)
c.set_text_axis(f"$M[y=1] = ({mx11:.2f}, {mx12:.2f})$\n"
                f"$M[y=-1] = ({mx21:.2f}, {mx22:.2f})$\n\n"
                f"$D[y=1] = ({Dx11:.2f}, {Dx12:.2f})$\n"
                f"$D[y=-1] = ({Dx21:.2f}, {Dx22:.2f})$", coord_text=(0.02, 0.96))

c.set_text_axis(f"Кол-во ошибок: {mistakes.count(2)}\n"
                f"Q = {Q}", coord_text=(0.02, 0.7))


plt.show()
print(Q)